In [84]:
import pandas as pd
import numpy as np

딕셔너리는 열로 붙여졌지만,   
리스트는 행으로 변환된다는 것을 인지하자.

In [11]:
# dic
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}
df = pd.DataFrame(dict_data)
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [16]:
# list
df = pd.DataFrame([[18, '남','김천고'], [19, '여', '울산고']],
                 index=['진현', '민지'],
                 columns=['나이', '성별', '학교'])
df

    나이 성별   학교
진현  18  남  김천고
민지  19  여  울산고

In [17]:
df.index=['학생1', '학생2']
print(df)

df.columns=['연령', '남녀', '연령']
print(df)

     나이 성별   학교
학생1  18  남  김천고
학생2  19  여  울산고
     연령 남녀   연령
학생1  18  남  김천고
학생2  19  여  울산고

In [18]:
# 행 삭제
df.drop('학생1', axis=0, inplace=True)
print(df)

# 열삭제
df.drop(['연령', '연령'], axis=1, inplace=True)
print(df)

     연령 남녀   연령
학생2  19  여  울산고
    남녀
학생2  여

In [19]:
# 행 선택

exam_data = {'수학':[100, 40, 70, 30], '영어': [50, 70, 90, 80], '생물': [50, 90, 70, 18], '도덕': [88, 68, 58, 77]}
df = pd.DataFrame(exam_data, index=['진현', '민지', '성철', '지산'])
df

     수학  영어  생물  도덕
진현  100  50  50  88
민지   40  70  90  68
성철   70  90  70  58
지산   30  80  18  77

In [20]:
df.loc['진현']

수학    100
영어     50
생물     50
도덕     88
Name: 진현, dtype: int64

In [21]:
df.iloc[0]

수학    100
영어     50
생물     50
도덕     88
Name: 진현, dtype: int64

In [22]:
#df.loc['민지':]
df.loc[['진현', '지산']]
#df.iloc[3:]
#df.iloc[[2, 1]]

     수학  영어  생물  도덕
진현  100  50  50  88
지산   30  80  18  77

In [24]:
# 열 선택
# df.수학, df['수학']=시리즈	df[['수학']]=데이터프레임

In [25]:
df.수학

진현    100
민지     40
성철     70
지산     30
Name: 수학, dtype: int64

In [26]:
df['수학']

진현    100
민지     40
성철     70
지산     30
Name: 수학, dtype: int64

In [27]:
df[['수학']]

     수학
진현  100
민지   40
성철   70
지산   30

In [29]:
df[['수학','영어']]

     수학  영어
진현  100  50
민지   40  70
성철   70  90
지산   30  80

In [36]:
# 인덱스 변경
exam_data = {'수학':[100, 40, 70, 30], '영어': [50, 70, 90, 80], '생물': [50, 90, 70, 18], '도덕': [88, 68, 58, 77]}
df = pd.DataFrame(exam_data, index=['진현', '민지', '성철', '지산'])
df

     수학  영어  생물  도덕
진현  100  50  50  88
민지   40  70  90  68
성철   70  90  70  58
지산   30  80  18  77

In [33]:
df.set_index('수학', inplace=True)
df

     영어  생물  도덕
수학
100  50  50  88
40   70  90  68
70   90  70  58
30   80  18  77

In [34]:
df.영어

수학
100    50
40     70
70     90
30     80
Name: 영어, dtype: int64

In [37]:
df.set_index(['수학', '생물'], inplace=True)
df

        영어  도덕
수학  생물
100 50  50  88
40  90  70  68
70  70  90  58
30  18  80  77

In [39]:
# 특정 데이터 추출
# data.loc[행, 열]
# data.iloc[행, 열]
exam_data = {'이름': ['진현', '민지', '성철', '지산'], '수학':[100, 40, 70, 30], \
    '영어': [50, 70, 90, 80], '생물': [50, 90, 70, 18], '도덕': [88, 68, 58, 77]}
df = pd.DataFrame(exam_data)
df

   이름   수학  영어  생물  도덕
0  진현  100  50  50  88
1  민지   40  70  90  68
2  성철   70  90  70  58
3  지산   30  80  18  77

In [40]:
df2 = df.set_index('이름')
df2

     수학  영어  생물  도덕
이름
진현  100  50  50  88
민지   40  70  90  68
성철   70  90  70  58
지산   30  80  18  77

In [43]:
df2.iloc[1, 1:3]

영어    70
생물    90
Name: 민지, dtype: int64

In [44]:
df2.loc['민지', '영어':'도덕']

영어    70
생물    90
도덕    68
Name: 민지, dtype: int64

In [47]:
df2.loc['민지', ['영어', '생물']]

영어    70
생물    90
Name: 민지, dtype: int64

In [49]:
# 범위 슬라이싱
# DataFrame객체.iloc[ 시작인덱스 : 끝 인덱스 : 슬라이싱간격 ]

In [50]:
df2.iloc[:2]

     수학  영어  생물  도덕
이름
진현  100  50  50  88
민지   40  70  90  68

In [51]:
df2.iloc[1:4:2]

    수학  영어  생물  도덕
이름
민지  40  70  90  68
지산  30  80  18  77

In [54]:
df2.iloc[::]

     수학  영어  생물  도덕
이름
진현  100  50  50  88
민지   40  70  90  68
성철   70  90  70  58
지산   30  80  18  77

In [55]:
df2.iloc[::-1]

     수학  영어  생물  도덕
이름
지산   30  80  18  77
성철   70  90  70  58
민지   40  70  90  68
진현  100  50  50  88

In [56]:
# 열행 추가

In [63]:
exam_data = {'이름': ['진현', '민지', '성철', '지산'], '수학':[100, 40, 70, 30], \
    '영어': [50, 70, 90, 80], '생물': [50, 90, 70, 18], '도덕': [88, 68, 58, 77]}
df = pd.DataFrame(exam_data)
df

   이름   수학  영어  생물  도덕
0  진현  100  50  50  88
1  민지   40  70  90  68
2  성철   70  90  70  58
3  지산   30  80  18  77

In [64]:
df['국어'] = 80
df

   이름   수학  영어  생물  도덕  국어
0  진현  100  50  50  88  80
1  민지   40  70  90  68  80
2  성철   70  90  70  58  80
3  지산   30  80  18  77  80

In [65]:
df.loc[1] = ['하나', 1, 2, 3, 4, 5]
df

   이름   수학  영어  생물  도덕  국어
0  진현  100  50  50  88  80
1  하나    1   2   3   4   5
2  성철   70  90  70  58  80
3  지산   30  80  18  77  80

In [66]:
df.loc[4] = 100
df

    이름   수학   영어   생물   도덕   국어
0   진현  100   50   50   88   80
1   하나    1    2    3    4    5
2   성철   70   90   70   58   80
3   지산   30   80   18   77   80
4  100  100  100  100  100  100

In [67]:
# 전치 (transpose())

In [68]:
exam_data = {'이름': ['진현', '민지', '성철', '지산'], '수학':[100, 40, 70, 30], '영어': [50, 70, 90, 80], '생물': [50, 90, 70, 18], '도덕': [88, 68, 58, 77]}
df = pd.DataFrame(exam_data)
df

   이름   수학  영어  생물  도덕
0  진현  100  50  50  88
1  민지   40  70  90  68
2  성철   70  90  70  58
3  지산   30  80  18  77

In [69]:
df = df.transpose()
df

      0   1   2   3
이름   진현  민지  성철  지산
수학  100  40  70  30
영어   50  70  90  80
생물   50  90  70  18
도덕   88  68  58  77

In [70]:
df = df.T
df

   이름   수학  영어  생물  도덕
0  진현  100  50  50  88
1  민지   40  70  90  68
2  성철   70  90  70  58
3  지산   30  80  18  77

In [71]:
# 행 인덱스 수정

In [72]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [73]:
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf = df.reindex(new_index)
ndf

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [77]:
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf2 = df.reindex(new_index, fill_value=0)
ndf2

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [78]:
ndf = df.reset_index()
ndf

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [88]:
# 정렬
# 인덱스 정렬: sort_index()
# 디폴트 값은 오름차순이지만, 내림차순으로 정리하려면 ascending=False
# 객체의 값에 따라 정렬: sort_values()

In [81]:
data = pd.Series(range(4), index=['d', 'b', 'c', 'a'])
data

d    0
b    1
c    2
a    3
dtype: int64

In [82]:
data.sort_index()

a    3
b    1
c    2
d    0
dtype: int64

In [85]:
frame = pd.DataFrame(np.arange(8).reshape(2, 4), 
                    index=['three', 'one'],
                    columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [86]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [87]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [89]:
data = pd.Series([4, 9, np.nan, 3, -1, np.nan])
data

0    4.0
1    9.0
2    NaN
3    3.0
4   -1.0
5    NaN
dtype: float64

In [90]:
data.sort_values()

4   -1.0
3    3.0
0    4.0
1    9.0
2    NaN
5    NaN
dtype: float64

In [94]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 1, 0]})
frame

   b  a
0  4  0
1  7  1
2 -3  1
3  2  0

In [92]:
frame.sort_values(by='b')

   b  a
2 -3  1
3  2  0
0  4  0
1  7  1

In [95]:
frame.sort_values(by=['a', 'b'])

   b  a
3  2  0
0  4  0
2 -3  1
1  7  1

# 
AI Platform/Web - 판다스 기초 한번에 정리  
https://han-py.tistory.com/311